mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xl/s6e2c4xl.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "UNIQUE_ID" -->
    <peripheral>
      <name>UNIQUE_ID</name>
      <description>Unique ID</description>
      <version>A</version>
      <groupName>UNIQUE_ID</groupName>
      <baseAddress>0x40000200</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UIDR0" -->
        <register>
          <name>UIDR0</name>
          <description>Unique ID Register 0 [W]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UID" -->
            <field>
              <name>UID</name>
              <description>Unique ID 27 through 0</description>
              <msb>31</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UIDR1" -->
        <register>
          <name>UIDR1</name>
          <description>Unique ID Register 1 [W]</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UID" -->
            <field>
              <name>UID</name>
              <description>Unique ID 40 through 28</description>
              <msb>12</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "ECC_CAPTURE" -->
    <peripheral>
      <name>ECC_CAPTURE</name>
      <description>ECC Capture Address</description>
      <version>A</version>
      <groupName>ECC_CAPTURE</groupName>
      <baseAddress>0x40000300</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "FERRAD" -->
        <register>
          <name>FERRAD</name>
          <description>Flash ECC Error Address Capture Register [W]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRAD" -->
            <field>
              <name>ERRAD</name>
              <description>Flash ECC Error Address Capture</description>
              <msb>22</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DUALFLASH_IF" -->
    <peripheral>
      <name>DUALFLASH_IF</name>
      <description>Dual Flash Memory</description>
      <version>A</version>
      <groupName>DUALFLASH_IF</groupName>
      <baseAddress>0x40000400</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "DFASZR" -->
        <register>
          <name>DFASZR</name>
          <description>Dual Flash Access Size Register [BHW]</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DASZ" -->
            <field>
              <name>DASZ</name>
              <description>Dual Flash Access Size</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DFRWTR" -->
        <register>
          <name>DFRWTR</name>
          <description>Dual Flash Read Wait Register [BHW]</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DRWT" -->
            <field>
              <name>DRWT</name>
              <description>Dual Flash Read Wait Cycle</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DFSTR" -->
        <register>
          <name>DFSTR</name>
          <description>Dual Flash ECC Error [BHW]</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DFERR" -->
            <field>
              <name>DFERR</name>
              <description>Dual Flash ECC Error</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DFHNG" -->
            <field>
              <name>DFHNG</name>
              <description>Dual Flash Hang</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DFRDY" -->
            <field>
              <name>DFRDY</name>
              <description>Dual Flash Rdy</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
