mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xl/s6e2c4xl.svd
        <!-- REGISTER "ICU_ICSA32" -->
        <register>
          <name>ICU_ICSA32</name>
          <description>ICU ch.2/3 Control Register A [BHW]</description>
          <alternateGroup>ICU</alternateGroup>
          <addressOffset>0x188</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ICP3" -->
            <field>
              <name>ICP3</name>
              <description>Indicates that a valid edge has been detected at ICU ch.(3) and the capture operation has been performed</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICP2" -->
            <field>
              <name>ICP2</name>
              <description>Indicates that a valid edge has been detected at ICU ch.(2) and the capture operation has been performed</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICE3" -->
            <field>
              <name>ICE3</name>
              <description>Generates interrupt when ICSA.ICP3 is set to 1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICE2" -->
            <field>
              <name>ICE2</name>
              <description>Generates interrupt when ICSA.ICP2 is set to 1</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EG3" -->
            <field>
              <name>EG3</name>
              <description>enables/disables the operation of ICU-ch.(3) and selects a valid edge(s)</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EG2" -->
            <field>
              <name>EG2</name>
              <description>enables/disables the operation of ICU-ch.(2) and selects a valid edge(s)</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ICU_ICSB32" -->
        <register>
          <name>ICU_ICSB32</name>
          <description>ICU ch.2/3 Control Register B [BHW]</description>
          <alternateGroup>ICU</alternateGroup>
          <addressOffset>0x189</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IEI3" -->
            <field>
              <name>IEI3</name>
              <description>indicates the latest valid edge of ICU ch.(3)</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IEI2" -->
            <field>
              <name>IEI2</name>
              <description>indicates the latest valid edge of ICU ch.(2)</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACFS10" -->
        <register>
          <name>ADCMP_ACFS10</name>
          <description>ADCMP ch.0/1 Connecting FRT Select Register [BHW]</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x170</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSA1" -->
            <field>
              <name>FSA1</name>
              <description>specify the FRT to be connected to ADCMP ch.(1)</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSA0" -->
            <field>
              <name>FSA0</name>
              <description>specify the FRT to be connected to ADCMP ch.(0)</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACFS32" -->
        <register>
          <name>ADCMP_ACFS32</name>
          <description>ADCMP ch.2/3 Connecting FRT Select Register [BHW]</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x171</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSA3" -->
            <field>
              <name>FSA3</name>
              <description>specify the FRT to be connected to ADCMP ch.(3)</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSA2" -->
            <field>
              <name>FSA2</name>
              <description>specify the FRT to be connected to ADCMP ch.(2)</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACFS54" -->
        <register>
          <name>ADCMP_ACFS54</name>
          <description>ADCMP ch.4/5 Connecting FRT Select Register [BHW]</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x172</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSA5" -->
            <field>
              <name>FSA5</name>
              <description>specify the FRT to be connected to ADCMP ch.(5)</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSA4" -->
            <field>
              <name>FSA4</name>
              <description>specify the FRT to be connected to ADCMP ch.(4)</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACMP0" -->
        <register>
          <name>ADCMP_ACMP0</name>
          <description>ADCMP ch.0 Compare Value Store Register [HW]</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1BA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ACMP" -->
            <field>
              <name>ACMP</name>
              <description>0</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACMP1" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP1</name>
          <description>ADCMP ch.1 Compare Value Store Register [HW]</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1BE</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP2" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP2</name>
          <description>ADCMP ch.2 Compare Value Store Register [HW]</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1C2</addressOffset>
        </register>
