mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xl/s6e2c4xl.svd
        <!-- REGISTER "SADSA0" -->
        <register>
          <name>SADSA0</name>
          <description>ADMA System Address Register 0 [BHW]</description>
          <addressOffset>0x58</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADR1500" -->
            <field>
              <name>ADR1500</name>
              <description>AdMA System Address [15:0]</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SADSA1" -->
        <register>
          <name>SADSA1</name>
          <description>ADMA System Address Register 1 [BHW]</description>
          <addressOffset>0x5A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADR3116" -->
            <field>
              <name>ADR3116</name>
              <description>AdMA System Address [31:16]</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SADSA2" -->
        <register>
          <name>SADSA2</name>
          <description>ADMA System Address Register 2 [BHW]</description>
          <addressOffset>0x5C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADR4732" -->
            <field>
              <name>ADR4732</name>
              <description>AdMA System Address [47:32]</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SADSA3" -->
        <register>
          <name>SADSA3</name>
          <description>ADMA System Address Register 3 [BHW]</description>
          <addressOffset>0x5E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADR6348" -->
            <field>
              <name>ADR6348</name>
              <description>AdMA System Address [63:48]</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SPRVAL0" -->
        <register>
          <name>SPRVAL0</name>
          <description>Preset Value Register for Initialization [BHW]</description>
          <addressOffset>0x60</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xC7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSSELVAL" -->
            <field>
              <name>DSSELVAL</name>
              <description>Driver Strength Select Value</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CGSELVAL" -->
            <field>
              <name>CGSELVAL</name>
              <description>Clock Generator Select Value</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCFSELVAL" -->
            <field>
              <name>SCFSELVAL</name>
              <description>SDCLK Frequency Select Value</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SPRVAL1" -->
        <register>
          <name>SPRVAL1</name>
          <description>Preset Value Register for Default Speed [BHW]</description>
          <addressOffset>0x62</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xC7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSSELVAL" -->
            <field>
              <name>DSSELVAL</name>
              <description>Driver Strength Select Value</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CGSELVAL" -->
            <field>
              <name>CGSELVAL</name>
              <description>Clock Generator Select Value</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCFSELVAL" -->
            <field>
              <name>SCFSELVAL</name>
              <description>SDCLK Frequency Select Value</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SPRVAL2" -->
        <register>
          <name>SPRVAL2</name>
          <description>Preset Value Register for High Speed [BHW]</description>
          <addressOffset>0x64</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xC7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSSELVAL" -->
            <field>
              <name>DSSELVAL</name>
              <description>Driver Strength Select Value</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CGSELVAL" -->
            <field>
              <name>CGSELVAL</name>
              <description>Clock Generator Select Value</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCFSELVAL" -->
            <field>
              <name>SCFSELVAL</name>
              <description>SDCLK Frequency Select Value</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SPRVAL3" -->
        <register>
          <name>SPRVAL3</name>
          <description>Preset Value Register for SDR12 [BHW]</description>
          <addressOffset>0x66</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xC7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSSELVAL" -->
            <field>
              <name>DSSELVAL</name>
              <description>Driver Strength Select Value</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CGSELVAL" -->
            <field>
              <name>CGSELVAL</name>
              <description>Clock Generator Select Value</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCFSELVAL" -->
            <field>
              <name>SCFSELVAL</name>
              <description>SDCLK Frequency Select Value</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SPRVAL4" -->
        <register>
          <name>SPRVAL4</name>
          <description>Preset Value Register for SDR25 [BHW]</description>
          <addressOffset>0x68</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xC7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSSELVAL" -->
            <field>
              <name>DSSELVAL</name>
              <description>Driver Strength Select Value</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CGSELVAL" -->
            <field>
              <name>CGSELVAL</name>
              <description>Clock Generator Select Value</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCFSELVAL" -->
            <field>
              <name>SCFSELVAL</name>
              <description>SDCLK Frequency Select Value</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
