mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xl/s6e2c4xl.svd
        <!-- REGISTER "ECR" -->
        <register>
          <name>ECR</name>
          <description>Error Counter Register [BHW]</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CEL" -->
            <field>
              <name>CEL</name>
              <description>CAN Error Logging</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RP" -->
            <field>
              <name>RP</name>
              <description>Receive Error Passive</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "REC" -->
            <field>
              <name>REC</name>
              <description>Receive Error Counter</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TEC" -->
            <field>
              <name>TEC</name>
              <description>Transmit Error Counter</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PSR" -->
        <register>
          <name>PSR</name>
          <description>Protocol Status Register [BHW]</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000707</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REDL" -->
            <field>
              <name>REDL</name>
              <description>Received a CAN FD Message</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RBRS" -->
            <field>
              <name>RBRS</name>
              <description>BRS flag of last received CAN FD Message</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RESI" -->
            <field>
              <name>RESI</name>
              <description>ESI flag of last received CAN FD Message</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FLEC" -->
            <field>
              <name>FLEC</name>
              <description>Fast Last Error Code</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BO" -->
            <field>
              <name>BO</name>
              <description>Bus_Off Status</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EW" -->
            <field>
              <name>EW</name>
              <description>Warning Status</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EP" -->
            <field>
              <name>EP</name>
              <description>Error Passive</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ACT" -->
            <field>
              <name>ACT</name>
              <description>Activity</description>
              <msb>4</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LEC" -->
            <field>
              <name>LEC</name>
              <description>Last Error Code</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IR" -->
        <register>
          <name>IR</name>
          <description>Interrupt Register [BHW]</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STE" -->
            <field>
              <name>STE</name>
              <description>Stuff Error</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FOE" -->
            <field>
              <name>FOE</name>
              <description>Format Error</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACKE" -->
            <field>
              <name>ACKE</name>
              <description>Acknowledge Error</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BE" -->
            <field>
              <name>BE</name>
              <description>Bit Error</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCE" -->
            <field>
              <name>CRCE</name>
              <description>CRC Error</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WDI" -->
            <field>
              <name>WDI</name>
              <description>Watchdog Interrupt</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BO" -->
            <field>
              <name>BO</name>
              <description>Bus_Off Status</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EW" -->
            <field>
              <name>EW</name>
              <description>Warning Status</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EP" -->
            <field>
              <name>EP</name>
              <description>Error Passive</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ELO" -->
            <field>
              <name>ELO</name>
              <description>Error Logging Overflow</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEU" -->
            <field>
              <name>BEU</name>
              <description>Bit Error Uncorrected</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEC" -->
            <field>
              <name>BEC</name>
              <description>Bit Error Corrected</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRX" -->
            <field>
              <name>DRX</name>
              <description>Message stored to Dedicated Rx Buffer</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOO" -->
            <field>
              <name>TOO</name>
              <description>Timeout Occurred</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MRAF" -->
            <field>
              <name>MRAF</name>
              <description>Message RAM Access Failure</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSW" -->
            <field>
              <name>TSW</name>
              <description>Timestamp Wraparound</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFL" -->
            <field>
              <name>TEFL</name>
              <description>Tx Event FIFO Element Lost</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFF" -->
            <field>
              <name>TEFF</name>
              <description>Tx Event FIFO Full</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFW" -->
            <field>
              <name>TEFW</name>
              <description>Tx Event FIFO Watermark Reached</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFN" -->
            <field>
              <name>TEFN</name>
              <description>Tx Event FIFO New Entry</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFE" -->
            <field>
              <name>TFE</name>
              <description>Tx FIFO Empty</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TCF" -->
            <field>
              <name>TCF</name>
              <description>Transmission Cancellation Finished</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TC" -->
            <field>
              <name>TC</name>
              <description>Transmission Completed</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HPM" -->
            <field>
              <name>HPM</name>
              <description>High Priority Message</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1L" -->
            <field>
              <name>RF1L</name>
              <description>Rx FIFO 1 Message Lost</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1F" -->
            <field>
              <name>RF1F</name>
              <description>Rx FIFO 1 Full</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1W" -->
            <field>
              <name>RF1W</name>
              <description>Rx FIFO 1 Watermark Reached</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1N" -->
            <field>
              <name>RF1N</name>
              <description>Rx FIFO 1 New Message</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0L" -->
            <field>
              <name>RF0L</name>
              <description>Rx FIFO 0 Message Lost</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0F" -->
            <field>
              <name>RF0F</name>
              <description>Rx FIFO 0 Full</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0W" -->
            <field>
              <name>RF0W</name>
              <description>Rx FIFO 0 Watermark Reached</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0N" -->
            <field>
              <name>RF0N</name>
              <description>Rx FIFO 0 New Message</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IE" -->
        <register>
          <name>IE</name>
          <description>Interrupt Enable [BHW]</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STEE" -->
            <field>
              <name>STEE</name>
              <description>Stuff Error Interrupt Enable</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FOEE" -->
            <field>
              <name>FOEE</name>
              <description>Format Error Interrupt Enable</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACKEE" -->
            <field>
              <name>ACKEE</name>
              <description>Acknowledge Error Interrupt Enable</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEE" -->
            <field>
              <name>BEE</name>
              <description>Bit Error Interrupt Enable</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCEE" -->
            <field>
              <name>CRCEE</name>
              <description>CRC Error Interrupt Enable</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WDIE" -->
            <field>
              <name>WDIE</name>
              <description>Watchdog Interrupt Interrupt Enable</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BOE" -->
            <field>
              <name>BOE</name>
              <description>Bus_Off Status Interrupt Enable</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EWE" -->
            <field>
              <name>EWE</name>
              <description>Warning Status Interrupt Enable</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EPE" -->
            <field>
              <name>EPE</name>
              <description>Error Passive Interrupt Enable</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ELOE" -->
            <field>
              <name>ELOE</name>
              <description>Error Logging Overflow Interrupt Enable</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEUE" -->
            <field>
              <name>BEUE</name>
              <description>Bit Error Uncorrected Interrupt Enable</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BECE" -->
            <field>
              <name>BECE</name>
              <description>Bit Error Corrected Interrupt Enable</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRXE" -->
            <field>
              <name>DRXE</name>
              <description>Message stored to Dedicated Rx Buffer Interrupt Enable</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOOE" -->
            <field>
              <name>TOOE</name>
              <description>Timeout Occurred Interrupt Enable</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MRAFE" -->
            <field>
              <name>MRAFE</name>
              <description>Message RAM Access Failure Interrupt Enable</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSWE" -->
            <field>
              <name>TSWE</name>
              <description>Timestamp Wraparound Interrupt Enable</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFLE" -->
            <field>
              <name>TEFLE</name>
              <description>Tx Event FIFO Element Lost Interrupt Enable</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFFE" -->
            <field>
              <name>TEFFE</name>
              <description>Tx Event FIFO Full Interrupt Enable</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFWE" -->
            <field>
              <name>TEFWE</name>
              <description>Tx Event FIFO Watermark Reached Interrupt Enable</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFNE" -->
            <field>
              <name>TEFNE</name>
              <description>Tx Event FIFO New Entry Interrupt Enable</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFEE" -->
            <field>
              <name>TFEE</name>
              <description>Tx FIFO Empty Interrupt Enable</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TCFE" -->
            <field>
              <name>TCFE</name>
              <description>Transmission Cancellation Finished Interrupt Enable</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TCE" -->
            <field>
              <name>TCE</name>
              <description>Transmission Completed Interrupt Enable</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HPME" -->
            <field>
              <name>HPME</name>
              <description>High Priority Message Interrupt Enable</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1LE" -->
            <field>
              <name>RF1LE</name>
              <description>Rx FIFO 1 Message Lost Interrupt Enable</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1FE" -->
            <field>
              <name>RF1FE</name>
              <description>Rx FIFO 1 Full Interrupt Enable</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1WE" -->
            <field>
              <name>RF1WE</name>
              <description>Rx FIFO 1 Watermark Reached Interrupt Enable</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1NE" -->
            <field>
              <name>RF1NE</name>
              <description>Rx FIFO 1 New Message Interrupt Enable</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0LE" -->
            <field>
              <name>RF0LE</name>
              <description>Rx FIFO 0 Message Lost Interrupt Enable</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0FE" -->
            <field>
              <name>RF0FE</name>
              <description>Rx FIFO 0 Full Interrupt Enable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0WE" -->
            <field>
              <name>RF0WE</name>
              <description>Rx FIFO 0 Watermark Reached Interrupt Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0NE" -->
            <field>
              <name>RF0NE</name>
              <description>Rx FIFO 0 New Message Interrupt Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
